Repository: pingfangx/TranslatorX-other
Catalog: miscellaneous/omegat/project_save.tmx
Source language: en_us
Languages: zh_cn

source: To bridge the gap we defined abstract classes `DefaultSubscriber`, `ResourceSubscriber` and `DisposableSubscriber` (plus their `XObserver` variants) for `Flowable` (and `Observable`) respectively that offers resource tracking support (of `Disposable`s) just like `rx.Subscriber` and can be cancelled/disposed externally via `dispose()`:
zh_cn: 为弥合这一差距，我们分别为 `Flowable`(和 `Observable`)定义了抽象类 `DefaultSubscriber`，`ResourceSubscriber` 和 `DisposableSubscriber`(加上它们的 `XObserver` 变体)，提供了资源跟踪支持(`Disposable`)就像 `rx.Subscriber` 一样，并可以通过 `dispose()` 从外部取消/处理：

source: To build:
zh_cn: 要构建：

source: To deal with this, a special control message, reset, has been devised.
zh_cn: 为了解决这个问题，我们设计了一个特殊的控制消息 reset。

source: To generate the key material, compute
zh_cn: 要生成密钥材料，进行计算

source: To handle such cases, RxJava has the `generate` factory method family.
zh_cn: 为了处理这种情况，RxJava 有 `generate` 工厂方法系列。

source: To handle such cases, a recent version of RxJava introduced the `create(emitter)` factory method.
zh_cn: 为了处理这种情况，最新版本的 RxJava 引入了 `create(emitter)` 工厂方法。

source: To illustrate, the example can be rewritten as follows:
zh_cn: 为了说明，该示例可以重写如下：

source: To indicate this opportunity, many operator names are suffixed with the `DelayError` words (while others feature a `delayError` or `delayErrors` boolean flag in one of their overloads):
zh_cn: 为了表明这个机会，许多运算符名称后缀为 `DelayError` (而其他运算符名称在其中一个重载中具有 `delayError` 或 `delayErrors` 布尔标志)：

source: To make sure the final API of 2.0 is clean as possible, we remove methods and other components between release candidates without deprecating them.
zh_cn: 为了确保 2.0 的最终 API 尽可能干净，我们在发布候选版本之间删除方法和其他组件而不弃用它们。

source: To prevent this, operators use so-called trampolining logic that prevents such reentrant calls.
zh_cn: 为了防止这种情况，操作符使用所谓的 trampolining 逻辑来阻止这种可重入的调用。

source: To remedy this, the method `E subscribeWith(E subscriber)` has been added to each base reactive class which returns its input subscriber/observer as is.
zh_cn: 为了解决这个问题，方法 `E subscribeWith(E subscriber)` 被添加到每个基本响应类中，该方法按原样返回其输入的订阅者/观察者。

source: To restate what is explicitly forbidden by the BNF, an HTTP/1.1 client MUST NOT preface or follow a request with an extra CRLF.
zh_cn: 要重述 BNF 明确禁止的内容，HTTP/1.1 客户端不得在请求前面或后面带有额外 CRLF。

source: To save space and take advantage of hierarchical locality, many Internet protocol elements and media type formats allow an abbreviation of a URI, whereas others restrict the syntax to a particular form of URI.
zh_cn: 为了节省空间并利用分层局部性，许多互联网协议元素和媒体类型格式允许 URI 的缩写，而其他格式将语法限制为特定形式的 URI。

source: To schedule recursive calls, you can use schedule and then schedule(this) on the Worker object:
zh_cn: 要调度递归调用，可以在 Worker 对象上使用 schedule 然后 schedule(this)：

source: To summarize: every segment emitted occupies one or more sequence numbers in the sequence space, the numbers occupied by a segment are "busy" or "in use" until MSL seconds have passed, upon crashing a block of space-time is occupied by the octets of the last emitted segment, if a new connection is started too soon and uses any of the sequence numbers in the space-time footprint of the last segment of the previous connection incarnation, there is a potential sequence number overlap area which could cause confusion at the receiver.
zh_cn: 总结一下：发射的每个报文段都占用了序列空间中的一个或多个序列号，报文段中占用的数字是“忙”或“正在使用”，直到 MSL 秒已经过去，一旦最后一个发射报文段的八位字节位所占用空间的块崩溃了，如果新连接过早启动并使用前一个连接化身的最后一个报文段的空时足迹中的任何序列号，则存在潜在的序列号重叠区域，这可能导致在接收器端的混淆。

source: To support our internal testing, all base reactive types now feature `test()` methods (which is a huge convenience for us) returning `TestSubscriber` or `TestObserver`:
zh_cn: 为了支持我们的内部测试，所有基本响应类型现在都有 `test()` 方法(这对我们来说非常方便)返回 `TestSubscriber` 或 `TestObserver`：

source: To understand what is a valid URI, both the grammar and the associated description have to be studied.
zh_cn: 要了解什么是有效 URI，必须研究语法和相关描述。

source: Traffic Key Calculation
zh_cn: 通信密钥计算

source: Transcription
zh_cn: 转录

source: Transfer Coding Registry
zh_cn: 传输编码注册

source: Transfer Codings
zh_cn: 传输编码

source: Transfer codings are defined in Section 4.
zh_cn: 传输编码在第 4 节中定义。

source: Transfer of Sensitive Information
zh_cn: 传递敏感信息

source: Transfer-Encoding MAY be sent in a response to a HEAD request or in a 304 (Not Modified) response (Section 4.1 of [RFC7232]) to a GET request, neither of which includes a message body, to indicate that the origin server would have applied a transfer coding to the message body if the request had been an unconditional GET.
zh_cn: 可以在对 HEAD 请求的响应或对 GET 请求的 304(未修改)响应([RFC7232] 的第 4.1 节)中发送 Transfer-Encoding，虽然两者都不包括消息体，以指示源服务器在请求是无条件的 GET 时，则已将传输编码应用于消息正文。

source: Transfer-Encoding MUST be used to indicate any transfer-codings applied by an application to ensure safe and proper transfer of the message.
zh_cn: 传输编码必须用于指示应用程序应用的任何传输编码，以确保安全和正确地传输消息。

source: Transfer-Encoding is a property of the message, not of the entity, and thus MAY be added or removed by any application along the request/response chain.
zh_cn: 传输编码是消息的属性，而不是实体的属性，因此可以由请求/响应链中的任何应用程序添加或删除。

source: Transfer-Encoding is analogous to the Content-Transfer-Encoding field of MIME, which was designed to enable safe transport of binary data over a 7-bit transport service ([RFC2045], Section 6).
zh_cn: Transfer-Encoding 类似于 MIME 的 Content-Transfer-Encoding 字段，旨在通过 7 位传输服务([RFC2045]，第 6 节)实现二进制数据的安全传输。

source: Transfer-Encoding was added in HTTP/1.1.
zh_cn: 在 HTTP/1.1 中添加了 Transfer-Encoding。

source: Transfer-coding values are used to indicate an encoding transformation that has been, can be, or may need to be applied to an entity-body in order to ensure "safe transport" through the network.
zh_cn: 传输编码值用于指示已经，可以或可能需要应用于实体主体的编码变换，以确保通过网络的“安全传输”。

source: Transfer-codings are analogous to the Content-Transfer-Encoding values of MIME [7], which were designed to enable safe transport of binary data over a 7-bit transport service.
zh_cn: 传输编码类似于 MIME [7] 的 Content-Transfer-Encoding 值，旨在通过 7 位传输服务实现二进制数据的安全传输。

source: Transforming Observable Items
zh_cn: 转换 Observable 项

source: Transforming Observables
zh_cn: 转换 Observables

source: Transmit the request-headers
zh_cn: 传输请求首部

source: Transparent Negotiation
zh_cn: 透明协商

source: Tunnels are commonly used to create an end-to-end virtual connection, through one or more proxies, which can then be secured using TLS (Transport Layer Security, [RFC5246]).
zh_cn: 隧道通常用于通过一个或多个代理创建端到端虚拟连接，然后可以使用 TLS(传输层安全性，[RFC5246])来保护隧道。

source: Tunnels are used to extend a virtual connection through an intermediary, such as when Transport Layer Security (TLS, [RFC5246]) is used to establish confidential communication through a shared firewall proxy.
zh_cn: 隧道用于通过中介扩展虚拟连接，例如当使用传输层安全性(TLS，[RFC5246])通过共享防火墙代理建立机密通信时。

source: Two forms of length octets are specified.
zh_cn: 指定了两种形式的长度八位字节。

source: Type
zh_cn: 类型

source: Typed constants can be defined for purposes of specification by declaring a symbol of the desired type and assigning values to it.
zh_cn: 通过声明所需类型的符号并为其赋值，可以为规范目的定义类型常量。

source: Typically, the server has no external knowledge of what the client's identity ought to be and so checks (other than that the client has a certificate chain rooted in an appropriate CA) are not possible.
zh_cn: 通常，服务器不知道客户端的身份应该是什么，因此检查(除了客户端具有植根于适当 CA 的证书链之外)是不可能的。

source: Typically, you can move computations or blocking IO to some other thread via `subscribeOn`.
zh_cn: 通常，您可以通过 `subscribeOn` 将计算或阻塞 IO 移动到其他线程。

source: UPALPHA = <any US-ASCII uppercase letter "A".."Z">
zh_cn: UPALPHA = <任何 US-ASCII 大写字母 "A".."Z">

source: URG: Urgent Pointer field significant
zh_cn: URG：指明紧急指针字段

source: URI Comparison
zh_cn: URI 比较

source: URI Format
zh_cn: URI 格式

source: URI Reference
zh_cn: URI 引用

source: URI Scheme Registration
zh_cn: URI 方案注册

source: URI are characterized by the following definitions:
zh_cn: URI 的特征在于以下定义：

source: URI producers and normalizers should omit the ":" delimiter that separates host from port if the port component is empty.
zh_cn: URI 生成器和规范化器应省略将主机与端口分开的“:”分隔符，如果端口组件为空。

source: URI producers and normalizers should omit the port component and its ":" delimiter if port is empty or if its value would be the same as that of the scheme's default.
zh_cn: 如果 port 为空或者其值与方案的默认值相同，则 URI 生成器和规范化器应省略端口组件及其“:”分隔符。

source: URI producers should provide these registered names in the IDNA encoding, rather than a percent-encoding, if they wish to maximize interoperability with legacy URI resolvers.
zh_cn: 如果 URI 生成者希望最大化与传统 URI 解析器的互操作性，则应该以 IDNA 编码提供这些注册名称，而不是百分比编码。

source: URI producers should use names that conform to the DNS syntax, even when use of DNS is not immediately apparent, and should limit these names to no more than 255 characters in length.
zh_cn: URI 生成器应使用符合 DNS 语法的名称，即使 DNS 的使用不明显，并且应将这些名称限制为不超过 255 个字符。

source: URI producing applications must not use percent-encoding in host unless it is used to represent a UTF-8 character sequence.
zh_cn: URI 生成应用程序不得在主机中使用百分比编码，除非它用于表示 UTF-8 字符序列。

source: URI producing applications often use the reserved characters allowed in a segment to delimit scheme-specific or dereference-handler-specific subcomponents.
zh_cn: URI 生成应用程序通常使用段中允许的保留字符来分隔特定于方案或解除引用处理程序的子组件。

source: URI producing applications should percent-encode data octets that correspond to characters in the reserved set unless these characters are specifically allowed by the URI scheme to represent data in that component.
zh_cn: URI 生成应用程序应对与保留集中的字符对应的数据八位字节进行百分比编码，除非 URI 方案明确允许这些字符表示该组件中的数据。

source: URI references are used to target requests, indicate redirects, and define relationships.
zh_cn: URI 引用用于定位请求，指示重定向和定义关系。

source: URI scheme specifications must define their own syntax so that all strings matching their scheme-specific syntax will also match the <absolute-URI> grammar, as described in Section 4.3.
zh_cn: URI 方案规范必须定义自己的语法，以便匹配其特定于方案的语法的所有字符串也将匹配 <absolute-URI> 语法，如第 4.3 节所述。

source: URI scheme specifications must define their own syntax so that all strings matching their scheme-specific syntax will also match the <absolute-URI> grammar.
zh_cn: URI 方案规范必须定义自己的语法，以便匹配其特定于方案的语法的所有字符串也将匹配 <absolute-URI> 语法。

source: URI-reference is used to denote the most common usage of a resource identifier.
zh_cn: URI-reference 用于表示资源标识符的最常见用法。

source: URIs are characterized as follows:
zh_cn: URI 的特征如下：

source: URIs have a global scope and are interpreted consistently regardless of context, though the result of that interpretation may be in relation to the end-user's context.
zh_cn: URI 具有全局范围，并且无论上下文如何都被一致地解释，尽管该解释的结果可能与最终用户的上下文有关。

source: URIs have been known by many names: WWW addresses, Universal Document Identifiers, Universal Resource Identifiers [3], and finally the combination of Uniform Resource Locators (URL) [4] and Names (URN) [20].
zh_cn: URI 有许多名称：WWW 地址，通用文档标识符，统一资源标识符 [3]，最后是统一资源定位符(URL)[4] 和统一资源名称(URN)[20] 的组合。

source: URIs in HTTP can be represented in absolute form or relative to some known base URI [11], depending upon the context of their use.
zh_cn: HTTP 中的 URI 可以用绝对形式或相对于某个已知的基 URI [11] 来表示，具体取决于它们的使用环境。

source: URIs include components and subcomponents that are delimited by characters in the "reserved" set.
zh_cn: URI 包括由“保留”集中的字符分隔的组件和子组件。

source: URIs that differ in the replacement of a reserved character with its corresponding percent-encoded octet are not equivalent.
zh_cn: 将保留字符替换为其对应的百分比编码的八位字节的 URI 是不等效的。

source: URIs that differ in the replacement of an unreserved character with its corresponding percent-encoded US-ASCII octet are equivalent: they identify the same resource.
zh_cn: 使用相应的百分比编码的 US-ASCII 八位字节替换非保留字符的 URI 是等效的：它们标识相同的资源。

source: URIs that identify in relation to the end-user's local context should only be used when the context itself is a defining aspect of the resource, such as when an on-line help manual refers to a file on the end-user's file system (e.g., "file:///etc/hosts").
zh_cn: 仅当上下文本身是资源的定义方面时才应使用与最终用户的本地上下文相关的 URI，例如当联机帮助手册引用最终用户的文件系统上的文件时(例如，，“file:///etc/hosts”)。

source: Under normal conditions, TCPs keep track of the next sequence number to emit and the oldest awaiting acknowledgment so as to avoid mistakenly using a sequence number over before its first use has been acknowledged.
zh_cn: 在正常情况下，TCP 会跟踪要发射的下一个序列号和最旧的等待确认，以避免在第一次使用确认之前错误地使用序列号。

source: Under-specified types (opaque, variable-length vectors, and structures that contain opaque) cannot be assigned values.
zh_cn: 未指定的类型(不透明，可变长度 vector 和包含不透明的结构)不能赋值。

source: Unfortunately, RxJava can't tell which of these out-of-lifecycle, undeliverable exceptions should or shouldn't crash your app.
zh_cn: 不幸的是，RxJava 无法分辨这些生命周期中的哪些，无法传递的异常应该或不应该使您的应用程序崩溃。

source: Unfortunately, `just` is often mistaken for a way to compute something dynamically to be consumed by `Subscriber`s:
zh_cn: 不幸的是，`just` 经常被误认为是一种供订阅者使用的动态计算东西的方式：

source: Unfortunately, many method calls across the JVM and other libraries throw checked exceptions and need to be wrapped into `try-catch`es as the functional interfaces used by this class don't allow throwing checked exceptions.
zh_cn: 不幸的是，JVM 和其他库中的许多方法调用抛出了检查型异常，需要将其包装到 `try-catch` 中，因为此类使用的函数接口不允许抛出检查型异常。

source: Unfortunately, so many depend on it that we couldn't remove or rename it.
zh_cn: 不幸的是，很多人依赖它，我们无法移除或重命名它。

source: Unfortunately, some middleboxes fail when presented with new values.
zh_cn: 不幸的是，一些中间盒在呈现新值时会失败。

source: Unfortunately, some old implementations use the negotiated version instead, and therefore checking the version number may lead to failure to interoperate with such incorrect client implementations.
zh_cn: 不幸的是，一些旧的实现使用协商版本，因此检查版本号可能导致无法与这种不正确的客户端实现进行互操作。

source: Unfortunately, some older HTTP/1.0 clients did not deal properly with an explicit charset parameter.
zh_cn: 不幸的是，一些较旧的 HTTP/1.0 客户端没有正确处理显式字符集参数。

source: Unfortunately, some user agents fail to properly encode or exclude whitespace found in hypertext references, resulting in those disallowed characters being sent in a request-target.
zh_cn: 遗憾的是，某些用户代理无法正确编码或排除在超文本引用中找到的空格，从而导致在请求目标中发送这些不允许的字符。

source: Unfortunately, the target language (and pre-existing conventions) may not give too much help in this regard (unusable keywords, type erasure, type ambiguities, etc.).
zh_cn: 不幸的是，目标语言(以及预先存在的约定)在这方面可能不会提供太多帮助(不可用的关键字，类型擦除，类型歧义等)。

source: Unfortunately, this approach doesn't work and the example does not print `2` at all.
zh_cn: 不幸的是，这种方法不起作用，该示例根本不打印 `2`。

source: Unfortunately, this prints `0` because `Single.just(count.get())` is evaluated at **assembly time** when the dataflow hasn't even run yet.
zh_cn: 不幸的是，这会输出 `0`，`Single.just(count.get())` 计算于 **assembly time**，数据流尚未运行。

source: Unfortunately, usually, these classical callback-style APIs don't support cancellation, but if they do, one can setup their cancellation just like in the previoius examples (with perhaps a more involved way though).
zh_cn: 不幸的是，通常，这些经典的回调式 API 不支持取消，但是如果它们这样支持，就可以像在上一示例中那样设置取消(尽管可能采用更复杂的方式)。

source: Uniform Resource Identifiers
zh_cn: 统一资源标识符

source: Uniform Resource Identifiers (URI) provide a simple and extensible means for identifying a resource.
zh_cn: 统一资源标识符(URI)提供了一种简单且可扩展的方法来识别资源。

source: Uniform Resource Identifiers (URIs) [RFC3986] are used throughout HTTP as the means for identifying resources (Section 2 of [RFC7231]).
zh_cn: 统一资源标识符(URI)[RFC3986] 在整个 HTTP 中用作识别资源的手段([RFC7231] 的第 2 节)。

source: Uniformity provides several benefits.
zh_cn: 统一性提供了几个好处。

source: Uniformity provides several benefits: it allows different types of resource identifiers to be used in the same context, even when the mechanisms used to access those resources may differ;
zh_cn: 统一性提供了几个好处：它允许在同一个上下文中使用不同类型的资源标识符，即使用于访问这些资源的机制可能不同；

source: Unless a transfer coding other than chunked has been applied, a client that sends a request containing a message body SHOULD use a valid Content-Length header field if the message body length is known in advance, rather than the chunked transfer coding, since some existing services respond to chunked with a 411 (Length Required) status code even though they understand the chunked transfer coding.
zh_cn: 除非已经应用了除 chunked 之外的传输编码，否则发送包含消息体的请求的客户端应该使用有效的 Content-Length 首部字段，如果事先知道消息体长度，而不是分块传输编码，因为一些已存在即使服务器理解了分块传输编码，服务也会响应具有 411(需要长度)状态代码的分块。

source: Unless noted otherwise, a recipient MAY attempt to recover a usable protocol element from an invalid construct.
zh_cn: 除非另有说明，否则接收方可以尝试从无效的构造中恢复可用的协议元素。

source: Unless otherwise indicated, URI references are parsed relative to the effective request URI (Section 5.5).
zh_cn: 除非另有说明，否则将相对于有效请求 URI 解析 URI 引用(第 5.5 节)。

source: Unless otherwise specified for a particular entity-header, the entity-headers in the PUT request SHOULD be applied to the resource created or modified by the PUT.
zh_cn: 除非为特定实体首部另外指定，否则 PUT 请求中的实体首部应该应用于由 PUT 创建或修改的资源。

source: Unless some other fatal alert has been transmitted, each party is required to send a close_notify alert before closing the write side of the connection.
zh_cn: 除非发送了其他致命警报，否则每个参与方都需要在关闭连接的写入端之前发送 close_notify 警报。

source: Unless specified otherwise, header fields defined in HTTP/1.1 are defined for all versions of HTTP/1.x.
zh_cn: 除非另有说明，否则 HTTP/1.1 中定义的首部字段是为所有版本的 HTTP/1.x 定义的。

source: Unless stated otherwise, the text is case-insensitive.
zh_cn: 除非另有说明，否则文本不区分大小写。

source: Unlike Content-Encoding (Section 3.1.2.1 of [RFC7231]), Transfer-Encoding is a property of the message, not of the representation, and any recipient along the request/response chain MAY decode the received transfer coding(s) or apply additional transfer coding(s) to the message body, assuming that corresponding changes are made to the Transfer-Encoding field-value.
zh_cn: 与内容编码（[RFC7231] 的第 3.1.2.1 节）不同，Transfer-Encoding 是消息的属性，而不是表示的属性，并且请求/响应链中的任何接收者可以解码接收的传输编码或应用假设对 Transfer-Encoding 字段值进行相应的更改，向消息体添加附加的传输编码。

source: Unlike `Flowable`, if there is only a single value to be signalled, only `onSuccess` is called and `onComplete` is not.
zh_cn: 与 `Flowable` 不同，如果只有一个值要发出信号，则只调用 `onSuccess` 而不调用 `onComplete`。

source: Unlike `onBackpressureDrop` there is always a value available for consumption if the downstream happened to be lagging behind.
zh_cn: 与 `onBackpressureDrop` 不同，如果下游恰好落后，总有一个值可供消费。

source: Unlike a proxy, a gateway receives requests as if it were the origin server for the requested resource; the requesting client may not be aware that it is communicating with a gateway.
zh_cn: 与代理不同，网关接收请求，就好像它是所请求资源的源服务器一样；请求客户端可能不知道它正在与网关通信。

source: Unlike distributed objects, the standardized request methods in HTTP are not resource-specific, since uniform interfaces provide for better visibility and reuse in network-based systems [REST].
zh_cn: 与分布式对象不同，HTTP 中的标准化请求方法不是特定于资源的，因为统一接口在基于网络的系统中提供了更好的可见性和重用 [REST]。

source: Unlike in RFC 2046, the epilogue of any multipart message MUST be empty; HTTP applications MUST NOT transmit the epilogue (even if the original multipart contains an epilogue).
zh_cn: 与 RFC 2046 不同，任何多部分消息的尾声必须为空；HTTP 应用程序不得传输结尾(即使原始多部分包含结尾)。

source: Unneeded handshake messages can be omitted, however.
zh_cn: 但是，可以省略不需要的握手消息。

source: Unrecognized header fields SHOULD be ignored by the recipient and MUST be forwarded by transparent proxies.
zh_cn: 接收者应该忽略无法识别的首部字段，而透明代理必须转发。

source: Unrecognized header fields are treated as entity-header fields.
zh_cn: 无法识别的首部字段被视为实体首部字段。

source: Unreserved Characters
zh_cn: 非保留字符

source: Unsubscribing
zh_cn: 取消订阅

source: Unused values are empty.
zh_cn: 未使用的值为空。

source: Updates Affecting TLS 1.2
zh_cn: 影响 TLS 1.2 的更新

source: Updates to RFC5246
zh_cn: RFC5246 的更新

source: Updates to RFC7525
zh_cn: RFC7525 的更新

source: Updating Traffic Secrets
zh_cn: 更新通信密钥

source: Upgrade
zh_cn: 升级

source: Upgrade Token Registry
zh_cn: 升级标记注册

source: Upon calling either method, the Single terminates and the subscription to it ends.
zh_cn: 在调用任一方法时，Single 终止并且对它的订阅结束。

source: Upon receipt of a HelloRetryRequest, the client MUST check the legacy_version, legacy_session_id_echo, cipher_suite, and legacy_compression_method as specified in Section 4.1.3 and then process the extensions, starting with determining the version using "supported_versions".
zh_cn: 收到 HelloRetryRequest 后，客户端必须检查第 4.1.3 节中指定的 legacy_version，legacy_session_id_echo，cipher_suite 和 legacy_compression_method，然后处理扩展，从使用“supported_versions”确定版本开始。

source: Upon receipt of the ServerHelloDone message, the client SHOULD verify that the server provided a valid certificate, if required, and check that the server hello parameters are acceptable.
zh_cn: 收到 ServerHelloDone 消息后，客户端应该验证服务器是否提供了有效的证书(如果需要)，并检查服务器 hello 参数是否可接受。

source: Upon receipt of this extension in a HelloRetryRequest, the client MUST verify that (1) the selected_group field corresponds to a group which was provided in the "supported_groups" extension in the original ClientHello and (2) the selected_group field does not correspond to a group which was provided in the "key_share" extension in the original ClientHello.
zh_cn: 在 HelloRetryRequest 中收到此扩展后，客户端必须验证(1)selected_group 字段是否对应于原始 ClientHello 中“supported_groups”扩展中提供的组，以及(2)selected_group 字段不对应于组它是在原始 ClientHello 的“key_share”扩展中提供的。

source: Upon receiving a message with type server_hello, implementations MUST first examine the Random value and, if it matches this value, process it as described in Section 4.1.4).
zh_cn: 在收到类型为 server_hello 的消息后，实现必须首先检查 Random 值，如果它匹配该值，则按照 4.1.4 节中的描述进行处理。

source: Upon receiving such an extension, an endpoint MUST abort the handshake with an "unsupported_extension" alert.
zh_cn: 收到这样的扩展后，端点必须通过“unsupported_extension”警报中止握手。

source: Upon receiving the ServerHello, clients MUST check that the cipher suite supplied in the ServerHello is the same as that in the HelloRetryRequest and otherwise abort the handshake with an "illegal_parameter" alert.
zh_cn: 收到 ServerHello 后，客户端必须检查 ServerHello 中提供的密码套件是否与 HelloRetryRequest 中的密码套件相同，否则将使用“illegal_parameter”警报中止握手。

source: Upon receiving the server's messages, the client responds with its Authentication messages, namely Certificate and CertificateVerify (if requested), and Finished.
zh_cn: 收到服务器的消息后，客户端将响应其 Authentication 消息，即 Certificate 和 CertificateVerify(如果请求)和 Finished。

source: Upon transmission or receipt of a fatal alert message, both parties immediately close the connection.
zh_cn: 在传输或收到致命警报消息时，双方立即关闭连接。

source: Upstream and downstream describe the flow of a message: all messages flow from upstream to downstream.
zh_cn: 上游和下游描述了消息的流程：所有消息都从上游流向下游。

source: Usage
zh_cn: 用法

source: Use `Schedulers.trampoline()` instead.
zh_cn: 请改用 `Schedulers.trampoline()`。

source: Use `safeSubscribe` to get an explicit safety wrapper around a consumer type.
zh_cn: 使用 `safeSubscribe` 获取消费者类型的显式安全包装。

source: Use of non-registered media types is discouraged.
zh_cn: 不鼓励使用未注册的媒体类型。

source: Use of program names for the identification of encoding formats is not desirable and is discouraged for future encodings.
zh_cn: 不希望使用程序名来识别编码格式，并且不鼓励将来用于编码。

source: Use of the 100 (Continue) Status
zh_cn: 使用 100(继续)状态

source: Use of the Max-Forwards header field allows the client to limit the length of the request chain, which is useful for testing a chain of proxies forwarding messages in an infinite loop.
zh_cn: 使用 Max-Forwards 首部字段允许客户端限制请求链的长度，这对于测试在无限循环中转发消息的代理链是有用的。

source: Use of the format "user:password" in the userinfo field is deprecated.
zh_cn: 不推荐在 userinfo 字段中使用“user:password”格式。

source: Use of the slash character to indicate hierarchy is only required when a URI will be used as the context for relative references.
zh_cn: 仅当 URI 将用作相对引用的上下文时，才需要使用斜杠字符来指示层次结构。

source: Use of the term `variant' does not necessarily imply that the resource is subject to content negotiation.
zh_cn: 使用术语“变体”并不一定意味着资源受内容协商的约束。

source: Use that variable and its new value to do something useful.
zh_cn: 使用该变量及其新值来做一些有用的事情。

source: User configuration of these values SHOULD also be limited in this fashion.
zh_cn: 这些值的用户配置也应该以这种方式受到限制。
